// tlog.c
// 测试 log(记录日志消息)

/* 包含头文件 ------------------------------------------------------------------------------------*/
#include "log.h"

/* 函数定义 --------------------------------------------------------------------------------------*/
int main(int argc, char *argv[])
{
    (void)argc;
    (void)argv;

    LOGE("test");
    LOGE("test: %d\n", 1);

    LOGW("test\n");
    LOGW("test: %d\n", 1);

    LOGI("test\n");
    LOGI("test: %d\n", 1);

    LOG_NEWLINE();

    return 0;
}

/****************************************** end of file *******************************************/
