/*
*********************************************************************************************************
* 文件: jitter.h
* 版本: V0.01
* 创建: Tue May 31 11:23:49 2016
* 作者: 谭化成
* 描述: 抖动缓冲区
*
* 版本历史
* +----------------------------------------------------------------------------------------------------+
* |    时间    |  版本  |                              描 述                              |    作者    |
* +----------------------------------------------------------------------------------------------------+
* | 2016/06/01 |  0.01  | 初版完成                                                        |  谭化成    |
* +----------------------------------------------------------------------------------------------------+
*
*********************************************************************************************************
*/

#ifndef JITTER_H_
#define JITTER_H_

/* 包含头文件 -----------------------------------------------------------------------------------------*/
#include <stddef.h>
#include <stdint.h>
#include <stdbool.h>

#ifdef __cplusplus
  extern "C" {
#endif

/* 宏定义 ---------------------------------------------------------------------------------------------*/
#define JITTER_PARAM_MUL_MAX    16
#define JITTER_PARAM_MUL_HIG    12
#define JITTER_PARAM_MUL_STD    8
#define JITTER_PARAM_MUL_LOW    4
#define JITTER_PARAM_MUL_MET    1

/* 数据类型声明 ---------------------------------------------------------------------------------------*/
typedef struct jitter jitter_t;

/* 函数声明 -------------------------------------------------------------------------------------------*/
jitter_t* jitter_create (const size_t size, const uint16_t unit);
int32_t jitter_read (jitter_t* jitter, void* buffer);
int32_t jitter_write (jitter_t* jitter, const void* buffer, uint16_t length);
int32_t jitter_flush (jitter_t* jitter);
int32_t jitter_destroy (jitter_t* jitter);

#ifdef __cplusplus
  }
#endif

#endif /* JITTER_H_ */
/********************************************* end of file *********************************************/

