/*
*********************************************************************************************************
* 文件: queue-array.h
* 版本: V0.02
* 创建: Thu May 26 14:08:13 2016
* 作者: 谭化成
* 描述: 列队(数组实现)
*
* 版本历史
* +----------------------------------------------------------------------------------------------------+
* |    时间    |  版本  |                              描 述                              |    作者    |
* +----------------------------------------------------------------------------------------------------+
* | 2016/05/30 |  0.01  | 初版完成                                                        |  谭化成    |
* +----------------------------------------------------------------------------------------------------+
* | 2016/06/08 |  0.02  | 数据长度类型定义为 int32_t                                      |  谭化成    |
* +----------------------------------------------------------------------------------------------------+
*
*********************************************************************************************************
*/

#ifndef QUEUE_ARRAY_H_
#define QUEUE_ARRAY_H_

/* 包含头文件 -----------------------------------------------------------------------------------------*/
#include <stddef.h>
#include <stdint.h>
#include <stdbool.h>

#ifdef __cplusplus
  extern "C" {
#endif

/* 宏定义 ---------------------------------------------------------------------------------------------*/

/* 数据类型声明 ---------------------------------------------------------------------------------------*/
typedef struct {
    struct {
        void* buff; /* 指向一块连续的内存区域 */
        size_t size; /* 数据单元占用字节数 */
        uint32_t mlen; /* buff最多可以存放的数据单元数 */
    } data;
    volatile uint32_t front;
    volatile uint32_t rear;
} queue_array_t;

/* 函数声明 -------------------------------------------------------------------------------------------*/
// 列队中的数据数量是以初始化时的 size 为单位的
int32_t queue_array_init (queue_array_t* q, void* buff, const size_t size, const int32_t mlen);
int32_t queue_array_read (queue_array_t* q, void* buff, int32_t length);
int32_t queue_array_fill (queue_array_t* q, const void* buff, int32_t length);
int32_t queue_array_write (queue_array_t* q, const void* buff, int32_t length);
int32_t queue_array_flush (queue_array_t* q);
int32_t queue_array_length (const queue_array_t* q);

#ifdef __cplusplus
  }
#endif

#endif /* QUEUE_ARRAY_H_ */
/********************************************* end of file *********************************************/

